In [24]:
import pandas as pd
import numpy as np
# Create dummy data
stuff = {'A':[1,2,3], 'B':[4,np.nan,6], 'C':[7,8,9], 'D':[10,11,12]}
my_df = pd.DataFrame(stuff)
my_df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

In [3]:
# Drop rows with null data
my_df.dropna()

   A    B  C   D
0  1  4.0  7  10
2  3  6.0  9  12

In [4]:
# Drop colummns with null data
my_df.dropna(axis=1) # axis default = 0 / row

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [5]:
# Not permanent, inplace=False
my_df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

In [23]:
# More than one? Set threshold
# Only delete columns with at least 2 Nan:
my_df.dropna(thresh=2, axis=1)

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [22]:
# Replace NaNs with fillna()
my_df.fillna('Bob')

   A    B  C   D
0  1  4.0  7  10
1  2  Bob  8  11
2  3  Bob  9  12

In [25]:
# Replace NaN with math function
my_df.fillna(value=my_df['B'].mean())

   A    B  C   D
0  1  4.0  7  10
1  2  5.0  8  11
2  3  6.0  9  12

In [27]:
# Use min or max
my_df.fillna(value=my_df['B'].max())

   A    B  C   D
0  1  4.0  7  10
1  2  6.0  8  11
2  3  6.0  9  12